app/Controllers/claseController.php

SELECT *
FROM `clase`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clase`
---
    public function index(): string
    {
        $claseModel = new ClaseModel();

        $perPage = 10;

        $data = [
            'clases' => $claseModel->paginate($perPage),
            'pager' => $claseModel->pager,
        ];