app/Controllers/clasesUsuarioController.php

SELECT *
FROM `clasesusuario`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clasesusuario`
---
    public function index(): string
    {
        $clasesusuarioModel = new ClaseusuarioModel();

        $perPage = 10;

        $data = [
            'clasesUsuario' => $clasesusuarioModel->paginate($perPage),
            'pager' => $clasesusuarioModel->pager,
        ];