app/Controllers/EventController.php

    public function fetchEvents()
    {
        $event = $this->eventModel->findAll();
---
SELECT *
FROM `event`

    public function addEvent()
    {
        $data = $this->request->getPost();

        // Log the received data for debugging
        log_message('debug', 'Received data for addEvent: ' . json_encode($data));

        // Check if data is not empty
        if (empty($data)) {
            // Handle the error, e.g., set a flash message or return an error response
            return redirect()->back()->with('error', 'No data provided for the event.');
        }

        // Validate the data (example: check if 'TITLE' and 'START_DATE' fields are present)
        if (empty($data['TITLE']) || empty($data['START_DATE'])) {
            return redirect()->back()->with('error', 'Title and start date are required.');
        }

        // Proceed with the insert if data is not empty
        if ($this->eventModel->insert($data)) {
---
INSERT INTO `event` (`TITLE`, `START_DATE`, `END_DATE`) VALUES ('z', '2025-02-13', '2025-02-14')