app/Controllers/pistaController.php

    public function index(): string
    {
        $pistaModel = new PistaModel();

        $perPage = 10;

        $data = [
            'pistas' => $pistaModel->paginate($perPage),
            'pager' => $pistaModel->pager,
        ];
---
SELECT *
FROM `pista`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pista`