app/Controllers/reservaController.php

    public function index(): string
    {
        $reservaModel = new ReservaModel();

        $perPage = 10;

        $data = [
            'reservas' => $reservaModel->paginate($perPage),
            'pager' => $reservaModel->pager,
        ];
---
SELECT *
FROM `reservas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `reservas`