app/Controllers/roleController.php

SELECT *
FROM `roles`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `roles`
---
    public function index(): string
    {
        $roleModel = new RoleModel();

        $perPage = 10;

        $data = [
            'roles' => $roleModel->paginate($perPage),
            'pager' => $roleModel->pager,
        ];