app/Controllers/userController.php

    public function index(): string
    {
        $userModel = new UserModel();

        $perPage = 10;

        $data = [
            'usuarios' => $userModel->paginate($perPage),
            'pager' => $userModel->pager,
        ];
---
SELECT *
FROM `usuarios`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuarios`